#include <stdio.h> // Подключение стандартной библиотеки ввода/вывода
#include <math.h> // Подключение библиотеки для использования математических функций


double lab9(void)
{ 
    double x = 0; // Переменная для ввода значения x
    double g = 0; // Переменная для хранения суммы выражения
    int n = 0; // Переменная для хранения количества элементов в последовательности
    int rc = 0; // Переменная для хранения кода возврата функции scanf
    while ((rc = scanf("%lf", &x)) == 1 && x > 0)
    {
        n++; // Увеличиваем счетчик количества элементов
        g += sqrt(n + x); // Добавляем корень от (n + x) к сумме
    }

    if (rc != 1)
    {
        return -1; // Возвращаем код ошибки
    }

    if (!n)
    {
        return -2; // Возвращаем код ошибки
    }

    return g / n;
}
int main(void)
{
    printf("Input values: \n"); // Выводим сообщение
    double result = lab9();
    if (result >= -1 && result <= -1)
    {
        printf("Error: Wrong input"); // Выводим сообщение об ошибке
        return 1;
    }
    else if (result >= -2 && result <= -2)
    {
        printf("Error: The sequence is empty"); // Выводим сообщение об ошибке
        return 1;
    }
    else
    {
        printf("g = %.6lf", result); // Выводим среднее арифметическое значения 
        return 0;
    }
    return 0; // Возврат успешного завершения программы
}

