#include <stdio.h> // Подключение стандартной библиотеки ввода/вывода
#include <math.h> // Подключение библиотеки для использования математических функций

int main(void)
{
    double ax, ay; // Объявление переменных для координат точки A
    double bx, by; // Объявление переменных для координат точки B
    double cx, cy; // Объявление переменных для координат точки C
    double a, b, c; // Объявление переменных для сторон треугольника

    printf("Input ax and ay: \n"); // Ввод координат точки A
    scanf("%lf%lf", &ax, &ay); // Считывание координат точки A
    printf("Input bx and by: \n"); // Ввод координат точки B
    scanf("%lf%lf", &bx, &by); // Считывание координат точки B
    printf("Input cx and cy: \n"); // Ввод координат точки C
    scanf("%lf%lf", &cx, &cy); // Считывание координат точки C

    a = sqrt((bx - cx) * (bx - cx) + (by - cy) * (by - cy)); // Расчет стороны a треугольника
    b = sqrt((ax - cx) * (ax - cx) + (ay - cy) * (ay - cy)); // Расчет стороны b треугольника
    c = sqrt((bx - ax) * (bx - ax) + (by - ay) * (by - ay)); // Расчет стороны c треугольника

    printf("Perimeter is %.6lf", a + b + c); // Вывод периметра треугольника с точностью до 6 знаков после запятой

    return 0; // Возврат успешного завершения программы
}

