#include <stdio.h> // Подключение стандартной библиотеки ввода/вывода

#define INT_MAX 2147483647 //максимально значение которое может хранить переменная типа int


// Функция для вычисления n-го числа Фибоначчи
int fib(int n)
{
    if (n == 0)
        return 0;

    int a = 0, b = 1, tmp; // Инициализация переменных для хранения чисел Фибоначчи
    for (int i = 1; i < n; i++)
    {
        if (b > INT_MAX - a)
            return -1;

        tmp = a + b; // Вычисление очередного числа Фибоначчи
        a = b; // Обновление переменных для следующей итерации
        b = tmp;
    }

    return b; // Возвращение значения числа Фибоначчи
}

int main(void)
{
    int n; // Объявление переменной для хранения числа n
    printf("Input n: \n"); // Вывод приглашения для ввода n

    // Если введено некорректное значение или n меньше нуля, выдается сообщение об ошибке
    if (scanf("%d", &n) != 1 || n < 0)
    {
        printf("Error: Wrong input.\n");
        return 1; // Возврат кода ошибки
    }

    int value = fib(n); // Вызов функции для вычисления числа Фибоначчи
    if (value == -1)
    {
        printf("Error: Overflow\n");
        return 1; // Возврат кода ошибки
    }

    printf("Answer is %d\n", value); // Вывод результата
    return 0; // Возврат успешного завершения программы
}
